INSERT INTO card (id, product_id, card_id, name, last_name, created_at, expiration_date, balance, status)
VALUES 
(1, '123456', '1234560000000001', 'Juan',  'Pérez',     '2025-01-01', '2028-01-01', 100.00, 'ACTIVE'),
(2, '123456', '1234560000000002', 'María', 'López',     '2025-02-01', '2028-02-01', 200.00, 'BLOCKED'),
(3, '654321', '6543210000000001', 'Pedro', 'García',    '2025-03-01', '2028-03-01', 350.00, 'EXPIRED'),
(4, '654321', '6543210000000002', 'Luisa', 'Martínez',  '2025-04-01', '2028-04-01', 500.00, 'ACTIVE'),
(5, '789456', '7894560000000001', 'Ana',   'Rivas',     '2025-05-01', '2028-05-01', 750.00, 'ACTIVE');